RIET/src/Documents/РучнаяКорректировкаLawson/РучнаяКорректировкаLawson.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РучнаяКорректировкаLawson</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
</mdclass:Document>

RIET/src/AccumulationRegisters/ПроводкиDSSОбщие/ПроводкиDSSОбщие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПроводкиDSSОбщие</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>BaseAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>RubAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FiscAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>TempDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>PermDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ExchDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>System</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GltObjId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TranAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PeriodLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модуль</name>
    <type>
      <types>EnumRef.МодулиРазработки</types>
    </type>
  </attributes>
  <dimensions>
    <name>AccountLawson</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FiscalType</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/РучнаяКорректировкаLawson/ObjectModule.bsl
Функция ПолучитьТаблицуСоответствияКолонок(ПорядокКолонок) Экспорт 
	
	табВозврата = Новый ТаблицаЗначений;
	табВозврата.Колонки.Добавить("НомерКолонки");
	табВозврата.Колонки.Добавить("Имя");
	
	СтрокаОбработки = ПорядокКолонок;
	НомерКолонки = 1;
	Пока СтрДлина(СтрокаОбработки) Цикл
		Позиция = СтрНайти(СтрокаОбработки, ",");
		Если Позиция Тогда
			ИмяКолонки = СокрЛП(Лев(СтрокаОбработки, Позиция - 1));
			СтрокаОбработки = СокрЛП(Прав(СтрокаОбработки, СтрДлина(СтрокаОбработки) - Позиция));
		Иначе
			ИмяКолонки = СокрЛП(СтрокаОбработки);
			СтрокаОбработки = "";
		КонецЕсли;
		НоваяСтрока = табВозврата.Добавить();
		НоваяСтрока.НомерКолонки = НомерКолонки;
		НоваяСтрока.Имя = ИмяКолонки;
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	Возврат табВозврата;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого Запись Из Движения.ПроводкиDSSОбщие Цикл
		Запись.Период = Запись.PeriodLawson;
		Если НЕ ЗначениеЗаполнено(Запись.GUID) Тогда
			Запись.GUID = Новый УникальныйИдентификатор();
		КонецЕсли;
		Запись.GltObjId = 1000000001;
	КонецЦикла;
	
КонецПроцедуры
